Revit 2026 API

# BuiltInFailuresAnalyticalAutomationFailures Class

---

Failures about Analytical Automation.

SystemObject Autodesk.Revit.DBBuiltInFailuresAnalyticalAutomationFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class AnalyticalAutomationFailures
```
```vb
Public NotInheritable Class AnalyticalAutomationFailures
```
```cpp
public ref class AnalyticalAutomationFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type AnalyticalAutomationFailures = class end
```

The BuiltInFailuresAnalyticalAutomationFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | EmptySelection | There are no selected elements. |

#### Reference

Autodesk.Revit.DB Namespace